narbiscorp/edge-earclip/EDGE/EDGE FIRMWARE/sdkconfig.defaults
# Narbis glasses — ESP-IDF defaults.
# Pin: ESP-IDF v5.5.1 (matches earclip; see CLAUDE.md). Do not silently upgrade.
#
# Glasses run an ESP32 (NOT ESP32-C6 like the earclip). The Bluedroid host
# stack is used here intentionally — porting glasses to NimBLE is tracked
# as a v2 cleanup in TODO.md. Earclip uses NimBLE.

# ---------------- target ----------------
CONFIG_IDF_TARGET="esp32"

# ---------------- flash + partition table ----------------
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ---------------- Bluetooth (Bluedroid host, dual-role) ----------------
# Path B: glasses are now both BLE peripheral (existing OTA + control
# service on 0xFF01..0xFF04 still serves the phone/dashboard) AND BLE
# central (connects to a Narbis earclip and subscribes to IBI notifies).
# Both roles live in one Bluedroid stack.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_GATTS_ENABLE=y
CONFIG_BT_GATTC_ENABLE=y
CONFIG_BT_BLE_DUAL_ROLE=y

# ---------------- Power management ----------------
# Light sleep is disabled in this firmware (breaks BLE streaming); CPU is
# capped at 80 MHz via esp_pm_configure in app_main. Keep PM framework on
# so the existing esp_pm_configure call path stays valid.
CONFIG_PM_ENABLE=y

# ---------------- Logging ----------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
